//함수호출을 맨밑에서 선언하면 정상호출 되지만 ~ 맨앞에서하면 애로우펑션으로 선언한 것은 오류가 난다.
hoist1();
// hoist2(); 호출되지 않음!  에러!

// 호이스팅(hoisting) : (콜스텍이) 코드 실행 전 메모리에 객체를 선언하고 저장하는 할당하는 작업 
function hoist1(){
    console.log("호이스팅 1"); //일반적 변수 선언
}
const hoist2=()=>{
    console.log("호이스팅 2"); //애로우펑션으로 선언하는 법
}

hoist2(); //arrow 함수는 반드시 선언 후 함수 호출  ! !
// 즉 arrow함수는 호이스팅이 되지 않는다. 

/**
 * 호이스팅은 콜스택이 인터프리터 형식으로 실행되기 전....
 * function이 붙은 함수들은 코드가 실행되기 전 미리 꺼내서 힙 메모리에 hoist 객체로 만들어놓는다. 
 * 따라서 호출 전에 선언되어도 출력이 가능하다.
 * 
 * const나 let로 선언한 애로우 펑션은 호출하기 전에 미리 메모리를 생성하지 않기 때문에 
 * (V8엔진이 가진 기본정의 로직대로 따라가기 위한 요소라고 할 수 있음) 선언 후 호출하여야한다.
 */

